{
  "prayers": [
    {
      "id": 1,
      "title": "Prayer to Your Patron Saint — A",
      "theme": "patron",
      "saint": "St. Sava",
      "text": "Saint (Name), Holy Mother of God and all the saints, who have pleased God in Your lives; pray to Christ my Lord that I might live this day in peace, love and humility."
    },
    {
      "id": 2,
      "title": "Prayer to Your Patron Saint — B",
      "theme": "patron",
      "saint": "St. Seraphim Rose",
      "text": "Pray unto God for me, O Holy Saint (Name), well-pleasing to God: for I turn to you, who are a speedy helper and intercessor for my soul."
    },
    {
      "id": 3,
      "title": "Prayer to Your Guardian Angel",
      "theme": "guardian",
      "saint": "St. Basil the Great",
      "text": "O Angel of Christ, holy guardian and protector of my soul and body, forgive me of everything I have done to offend you every day, and protect me from all influence and temptation of the evil one. May I never offend God by my sin. Pray for me to the Lord, that He may make me worthy of the grace of the All-holy Trinity, and of the Most Blessed Theotokos, and of all the Saints. Amen."
    },
    {
      "id": 4,
      "title": "Prayer Upon Entering a Church",
      "theme": "church",
      "saint": "St. John Chrysostom",
      "text": "I will come into Your house in the greatness of Your mercy: and in fear I will worship toward Your holy temple. Lead me, O Lord, in Your righteousness because of my enemies; make Your way straight before me, that with a clear mind I may glorify You forever, One Divine Power worshiped in three persons: Father, Son, and Holy Spirit. Amen."
    },
    {
      "id": 5,
      "title": "Prayer upon Leaving a Church",
      "theme": "church",
      "saint": "St. Gregory of Nazianzus",
      "text": "Lord, now let Your servant depart in peace, according to Your word; for my eyes have seen Your salvation, which You have prepared in the presence of all people; a light to enlighten the Gentiles, and the glory of Your people Israel."
    },
    {
      "id": 6,
      "title": "Prayer for Fasting and Discipline",
      "theme": "fasting",
      "saint": "St. John Chrysostom",
      "text": "O Lord, who fasted forty days for us, grant me strength to abstain not only from food but from sinful desires. Purify my heart through fasting, that I may draw closer to Your divine will."
    },
    {
      "id": 7,
      "title": "Prayer for a Holy Fast",
      "theme": "fasting",
      "saint": "St. Basil the Great",
      "text": "God of mercy, guide us in this fast to seek Your face. Let our abstinence from earthly pleasures lead us to the feast of Your heavenly kingdom. Amen."
    },
    {
      "id": 8,
      "title": "Prayer for a Blessed Marriage",
      "theme": "marriage",
      "saint": "St. John Chrysostom",
      "text": "O Lord, who blessed the wedding at Cana, unite this couple in love and faith. May their marriage reflect Your divine harmony, enduring all trials with grace."
    },
    {
      "id": 9,
      "title": "Prayer for Marital Unity",
      "theme": "marriage",
      "saint": "St. Gregory of Nyssa",
      "text": "Creator of all, bind this husband and wife in mutual love. Let their home be a haven of peace, mirroring the unity of Your Holy Trinity."
    },
    {
      "id": 10,
      "title": "Prayer of Thanksgiving for Grace",
      "theme": "thanksgiving",
      "saint": "St. Seraphim of Sarov",
      "text": "O God, my joy, I thank You for Your unending mercies. Fill my soul with gratitude, that I may sing Your praises with a thankful heart."
    },
    {
      "id": 11,
      "title": "Thanksgiving After Deliverance",
      "theme": "thanksgiving",
      "saint": "St. John of Damascus",
      "text": "Glory to You, O Lord, who lifts us from affliction. For Your salvation, I offer ceaseless thanks, vowing to walk in Your light forever."
    },
    {
      "id": 12,
      "title": "Prayer for the Gift of Children",
      "theme": "having_children",
      "saint": "St. Justin Martyr",
      "text": "O Giver of life, bless this family with the gift of children. May they grow in Your truth, becoming heirs of Your eternal kingdom."
    },
    {
      "id": 13,
      "title": "Prayer for a Fruitful Womb",
      "theme": "having_children",
      "saint": "St. Irenaeus",
      "text": "Lord, who opened the barren womb of Sarah, grant the blessing of children to this couple. Let their home be filled with the joy of Your creation."
    },
    {
      "id": 14,
      "title": "Prayer Against Anger",
      "theme": "anger",
      "saint": "St. Gregory Palamas",
      "text": "O God of peace, calm the storm of anger in my heart. Grant me the meekness of Your Son, that I may respond with love in all trials."
    },
    {
      "id": 15,
      "title": "Prayer for Purity",
      "theme": "lust",
      "saint": "St. John Climacus",
      "text": "O Pure One, cleanse me from the passions of lust. Fill my soul with the radiance of Your holiness, that I may live as Your temple."
    },
    {
      "id": 16,
      "title": "Prayer Against Pride",
      "theme": "pride",
      "saint": "St. Basil the Great",
      "text": "Humble Lord, who humbled Yourself for our sake, cast down the pride in my heart. Teach me to walk in lowliness, glorifying only You."
    },
    {
      "id": 17,
      "title": "Prayer to Overcome Jealousy",
      "theme": "jealousy",
      "saint": "St. Gregory of Nyssa",
      "text": "O Generous God, heal my heart from jealousy. Let me rejoice in the blessings of others, trusting in Your perfect provision for all."
    },
    {
      "id": 18,
      "title": "Prayer for Mercy",
      "theme": "mercy",
      "saint": "St. Gregory of Nazianzus",
      "text": "Lord Jesus Christ, Son of God, have mercy on me, a sinner. Wash me in Your compassion, that I may stand clean before Your throne."
    },
    {
      "id": 19,
      "title": "Prayer for Divine Help",
      "theme": "help",
      "saint": "St. John Chrysostom",
      "text": "O Almighty Helper, support me in my weakness. Strengthen my resolve to follow You, granting aid in every trial through Your grace."
    },
    {
      "id": 20,
      "title": "Prayer to Follow God's Will",
      "theme": "gods_will",
      "saint": "St. Seraphim of Sarov",
      "text": "O Lord, who guides the stars, reveal Your will to me. Align my heart with Your purpose, that I may walk the path You have set."
    },
    {
      "id": 21,
      "title": "Prayer for Spiritual Closeness",
      "theme": "growing_closer",
      "saint": "St. John of Damascus",
      "text": "Draw me near, O Lord, to Your divine heart. Kindle in me the fire of Your love, that I may abide in You forever."
    },
    {
      "id": 22,
      "title": "Prayer for Divine Revelation",
      "theme": "revealing_more",
      "saint": "St. Justin Martyr",
      "text": "O Word of God, unveil Your mysteries to my soul. Grant me wisdom to understand Your truth and courage to live it fully."
    },
    {
      "id": 23,
      "title": "Prayer for Unbelievers",
      "theme": "unbelievers",
      "saint": "St. Irenaeus",
      "text": "O God, who desires all to know You, soften the hearts of unbelievers. Through Your saints, draw them to the light of Your Son."
    },
    {
      "id": 24,
      "title": "Prayer for Family Unity",
      "theme": "family",
      "saint": "St. Sava",
      "text": "O Lord, who binds us in love, unite this family in Your peace. May we reflect Your kingdom in our home, living in harmony."
    },
    {
      "id": 25,
      "title": "Prayer for Catechumens",
      "theme": "catechumens",
      "saint": "St. John Chrysostom",
      "text": "O Teacher of the faith, guide these catechumens to Your truth. Prepare their hearts for baptism, filling them with Your Holy Spirit."
    },
    {
      "id": 26,
      "title": "Prayer for Monastic Calling",
      "theme": "monasticism",
      "saint": "St. Anthony the Great",
      "text": "O Father of Monks, inspire those called to the monastic life. Grant them strength to renounce the world and seek You in solitude."
    },
    {
      "id": 27,
      "title": "Prayer for Monastic Endurance",
      "theme": "monasticism",
      "saint": "St. Seraphim of Sarov",
      "text": "O Joyful Ascetic, strengthen monks in their holy struggle. Let their prayers rise like incense, drawing them to Your light."
    },
    {
      "id": 28,
      "title": "Prayer for Fasting Strength",
      "theme": "fasting",
      "saint": "St. Gregory Palamas",
      "text": "O Hesychast, guide us in fasting to seek God’s stillness. Purify our hearts, that we may hunger for His righteousness alone."
    },
    {
      "id": 29,
      "title": "Prayer for Marital Love",
      "theme": "marriage",
      "saint": "St. Gregory of Nyssa",
      "text": "O Lord, sanctify this marriage with Your love. Let this couple grow in mutual devotion, reflecting Your eternal union."
    },
    {
      "id": 30,
      "title": "Prayer of Grateful Heart",
      "theme": "thanksgiving",
      "saint": "St. John of Damascus",
      "text": "O God, source of all good, I thank You for Your boundless gifts. Fill my soul with gratitude, that I may always glorify You."
    },
    {
      "id": 31,
      "title": "Prayer for Children’s Blessing",
      "theme": "having_children",
      "saint": "St. Justin Martyr",
      "text": "O Creator, bless this family with children as Your heritage. May they grow in faith, shining as lights in Your kingdom."
    },
    {
      "id": 32,
      "title": "Prayer Against Wrath",
      "theme": "anger",
      "saint": "St. John Climacus",
      "text": "O Lord, who endured all for us, quench the fire of wrath in me. Grant me patience to bear all things with Your peace."
    },
    {
      "id": 33,
      "title": "Prayer for Chastity",
      "theme": "lust",
      "saint": "St. Basil the Great",
      "text": "O Holy One, guard my senses from lustful thoughts. Make my body a temple of Your Spirit, pure and undefiled."
    },
    {
      "id": 34,
      "title": "Prayer Against Vainglory",
      "theme": "pride",
      "saint": "St. Gregory of Nazianzus",
      "text": "O Humble Savior, cast down the pride that exalts itself in me. Teach me to seek Your glory alone in all I do."
    },
    {
      "id": 35,
      "title": "Prayer for Contentment",
      "theme": "jealousy",
      "saint": "St. Irenaeus",
      "text": "O Generous God, free me from jealousy’s grasp. Let me find contentment in Your will, rejoicing in the blessings of all."
    },
    {
      "id": 36,
      "title": "Prayer for Fasting Discipline",
      "theme": "fasting",
      "saint": "St. John Chrysostom",
      "text": "Let the mouth fast from harsh words. Let the eyes fast from gazing at vanities. Let the heart fast from evil thoughts. This is the fast that pleases God."
    },
    {
      "id": 37,
      "title": "Prayer During the Great Fast",
      "theme": "fasting",
      "saint": "St. Basil the Great",
      "text": "O God, You who have commanded us to fast for the purification of our souls, grant us the grace to abstain not only from food but from sin, that we may draw nearer to Your divine presence."
    },
    {
      "id": 38,
      "title": "Prayer for Godly Marriage",
      "theme": "marriage",
      "saint": "St. John Chrysostom",
      "text": "O Lord, who sanctified marriage in Cana of Galilee, bless this union with Your grace. Let husband and wife live in harmony, bearing one another's burdens, and growing in love as they grow in faith."
    },
    {
      "id": 39,
      "title": "Prayer for Marital Harmony",
      "theme": "marriage",
      "saint": "St. Gregory of Nyssa",
      "text": "Almighty God, who created man and woman in Your image, grant to this couple the wisdom to nurture their bond with patience and forgiveness, that their love may reflect Your eternal unity."
    },
    {
      "id": 40,
      "title": "Prayer of Gratitude for Blessings",
      "theme": "thanksgiving",
      "saint": "St. Seraphim of Sarov",
      "text": "O Lord, my joy and my gladness, I thank You for the abundance of Your mercies. Every good gift comes from You; fill my heart with gratitude, that I may praise You with a pure and thankful spirit."
    },
    {
      "id": 41,
      "title": "Thanksgiving After Trials",
      "theme": "thanksgiving",
      "saint": "St. John of Damascus",
      "text": "Glory to You, O God, for delivering me from affliction. In Your compassion, You have turned my sorrow into joy. I offer thanks from the depths of my soul."
    },
    {
      "id": 42,
      "title": "Prayer for the Gift of Children",
      "theme": "having_children",
      "saint": "St. Justin Martyr",
      "text": "O Creator of all life, who formed man from the dust and breathed into him Your spirit, bless this family with the joy of children, as arrows in the hand of a mighty warrior."
    },
    {
      "id": 43,
      "title": "Prayer for Family Protection",
      "theme": "family",
      "saint": "St. Irenaeus",
      "text": "Lord, who knit us together in the womb and placed us in families as Your image-bearers, safeguard this household from harm. Let Your peace dwell among us, fostering love, faith, and unity in Your holy name."
    },
    {
      "id": 44,
      "title": "Prayer Against the Sin of Anger",
      "theme": "anger",
      "saint": "St. Gregory Palamas",
      "text": "O merciful God, who calms the raging sea, quiet the storm of anger within me. Grant me the serenity of Your Son, who endured betrayal without retaliation."
    },
    {
      "id": 45,
      "title": "Prayer for Purity from Lust",
      "theme": "lust",
      "saint": "St. John Climacus",
      "text": "Lord, who created us pure and undefiled, deliver me from the chains of lustful desires. Fill my heart with the fire of Your divine love, that I may seek only the beauty of Your holiness."
    },
    {
      "id": 46,
      "title": "Prayer Against Pride",
      "theme": "pride",
      "saint": "St. Basil the Great",
      "text": "Humble Maker of all, who exalted the lowly Virgin, crush the spirit of pride in me. Teach me to walk in meekness, recognizing that all I have is from Your hand."
    },
    {
      "id": 47,
      "title": "Prayer to Overcome Jealousy",
      "theme": "jealousy",
      "saint": "St. Gregory of Nyssa",
      "text": "O God of boundless generosity, who gives to each according to Your wisdom, free me from the poison of jealousy. Let me rejoice in the blessings of others as in my own."
    },
    {
      "id": 48,
      "title": "Prayer for Divine Mercy",
      "theme": "mercy",
      "saint": "St. Gregory of Nazianzus",
      "text": "Kyrie eleison, O Lord of compassion, who rained mercy upon Nineveh, extend Your tender mercy to this sinner. Wash me in the fountain of Your forgiveness."
    },
    {
      "id": 49,
      "title": "Prayer for Help in Weakness",
      "theme": "help",
      "saint": "St. John Chrysostom",
      "text": "Almighty Helper, who strengthened the apostles in their frailty, come to my aid in this hour of need. Uphold me by Your right hand, that I may persevere in faith and good works."
    },
    {
      "id": 50,
      "title": "Prayer to Discern God's Will",
      "theme": "gods_will",
      "saint": "St. Anthony the Great",
      "text": "O God, who called me from the world to serve You in solitude, reveal Your will to me. Grant me discernment to follow Your path, renouncing all that hinders my ascent to You."
    }
  ]
}